# **Lab 9: Tidying data: pivot, separate, unite**

In [0]:
library(tidyverse)

── Attaching packages ─────────────────────────────────────── tidyverse 1.3.0 ──

✔ ggplot2 3.2.1     ✔ purrr   0.3.3
✔ tibble  2.1.3     ✔ dplyr   0.8.4
✔ tidyr   1.0.2     ✔ stringr 1.4.0
✔ readr   1.3.1     ✔ forcats 0.4.0

── Conflicts ────────────────────────────────────────── tidyverse_conflicts() ──
✖ dplyr::filter() masks stats::filter()
✖ dplyr::lag()    masks stats::lag()

## **What is tidying data**

There are three interrelated rules which make a dataset tidy:

*   Each variable must have its own column.
*   Each observation must have its own row.
*   Each value must have its own cell.

Tidy data works well with R because R is a vectorized programming language. Data structures in R are built from vectors and R’s operations are optimized to work with vectors. Tidy data takes advantage of both of these traits.

## **Key value pairs**

A pair contains two parts: a key that explains what the information describes, and a value that contains the actual information. So for example,


```
Password: 0123456789 
```
where `0123456789` is the value, and it is associated with the key `Password`.

## **pivot_wider()**

`pivot_wider()` turns a pair of key:value columns into a set of tidy columns. It is an updated version of `spread()`.

In [0]:
head(fish_encounters, 20)
pivot_wider(fish_encounters, names_from = station, values_from = seen)

   fish station seen
1  4842 Release 1
2  4842 I80_1   1
3  4842 Lisbon  1
4  4842 Rstr    1
5  4842 Base_TD 1
6  4842 BCE     1
7  4842 BCW     1
8  4842 BCE2    1
9  4842 BCW2    1
10 4842 MAE     1
11 4842 MAW     1
12 4843 Release 1
13 4843 I80_1   1
14 4843 Lisbon  1
15 4843 Rstr    1
16 4843 Base_TD 1
17 4843 BCE     1
18 4843 BCW     1
19 4843 BCE2    1
20 4843 BCW2    1

   fish Release I80_1 Lisbon Rstr Base_TD BCE BCW BCE2 BCW2 MAE MAW
1  4842 1       1      1      1    1       1   1   1    1    1   1
2  4843 1       1      1      1    1       1   1   1    1    1   1
3  4844 1       1      1      1    1       1   1   1    1    1   1
4  4845 1       1      1      1    1      NA  NA  NA   NA   NA  NA
5  4847 1       1      1     NA   NA      NA  NA  NA   NA   NA  NA
6  4848 1       1      1      1   NA      NA  NA  NA   NA   NA  NA
7  4849 1       1     NA     NA   NA      NA  NA  NA   NA   NA  NA
8  4850 1       1     NA      1    1       1   1  NA   NA   NA  NA
9  4851 1       1     NA     NA   NA      NA  NA  NA   NA   NA  NA
10 4854 1       1     NA     NA   NA      NA  NA  NA   NA   NA  NA
11 4855 1       1      1      1    1      NA  NA  NA   NA   NA  NA
12 4857 1       1      1      1    1       1   1   1    1   NA  NA
13 4858 1       1      1      1    1       1   1   1    1    1   1
14 4859 1       1      1      1    1      NA  NA  NA   NA   NA  NA
15 4861 1       1      1      1    1       1   1   1    1    1   1
16 4862 1       1      1      1    1       1   1   1    1   NA  NA
17 4863 1       1     NA     NA   NA      NA  NA  NA   NA   NA  NA
18 4864 1       1     NA     NA   NA      NA  NA  NA   NA   NA  NA
19 4865 1       1      1     NA   NA      NA  NA  NA   NA   NA  NA

In [0]:
spread(fish_encounters, key = station, value = seen)

   fish Release I80_1 Lisbon Rstr Base_TD BCE BCW BCE2 BCW2 MAE MAW
1  4842 1       1      1      1    1       1   1   1    1    1   1
2  4843 1       1      1      1    1       1   1   1    1    1   1
3  4844 1       1      1      1    1       1   1   1    1    1   1
4  4845 1       1      1      1    1      NA  NA  NA   NA   NA  NA
5  4847 1       1      1     NA   NA      NA  NA  NA   NA   NA  NA
6  4848 1       1      1      1   NA      NA  NA  NA   NA   NA  NA
7  4849 1       1     NA     NA   NA      NA  NA  NA   NA   NA  NA
8  4850 1       1     NA      1    1       1   1  NA   NA   NA  NA
9  4851 1       1     NA     NA   NA      NA  NA  NA   NA   NA  NA
10 4854 1       1     NA     NA   NA      NA  NA  NA   NA   NA  NA
11 4855 1       1      1      1    1      NA  NA  NA   NA   NA  NA
12 4857 1       1      1      1    1       1   1   1    1   NA  NA
13 4858 1       1      1      1    1       1   1   1    1    1   1
14 4859 1       1      1      1    1      NA  NA  NA   NA   NA  NA
15 4861 1       1      1      1    1       1   1   1    1    1   1
16 4862 1       1      1      1    1       1   1   1    1   NA  NA
17 4863 1       1     NA     NA   NA      NA  NA  NA   NA   NA  NA
18 4864 1       1     NA     NA   NA      NA  NA  NA   NA   NA  NA
19 4865 1       1      1     NA   NA      NA  NA  NA   NA   NA  NA

You can generate column names from multiple variables:

In [0]:
head(us_rent_income, 15)

   GEOID NAME        variable estimate moe
1  01    Alabama     income   24476    136
2  01    Alabama     rent       747      3
3  02    Alaska      income   32940    508
4  02    Alaska      rent      1200     13
5  04    Arizona     income   27517    148
6  04    Arizona     rent       972      4
7  05    Arkansas    income   23789    165
8  05    Arkansas    rent       709      5
9  06    California  income   29454    109
10 06    California  rent      1358      3
11 08    Colorado    income   32401    109
12 08    Colorado    rent      1125      5
13 09    Connecticut income   35326    195
14 09    Connecticut rent      1123      5
15 10    Delaware    income   31560    247

In [0]:
us_rent_income %>%
  pivot_wider(names_from = variable, values_from = c(estimate, moe))

   GEOID NAME                 estimate_income estimate_rent moe_income moe_rent
1  01    Alabama              24476            747          136         3
2  02    Alaska               32940           1200          508        13
3  04    Arizona              27517            972          148         4
4  05    Arkansas             23789            709          165         5
5  06    California           29454           1358          109         3
6  08    Colorado             32401           1125          109         5
7  09    Connecticut          35326           1123          195         5
8  10    Delaware             31560           1076          247        10
9  11    District of Columbia 43198           1424          681        17
10 12    Florida              25952           1077           70         3
11 13    Georgia              27024            927          106         3
12 15    Hawaii               32453           1507          218        18
13 16    Idaho                25298            792          208         7
14 17    Illinois             30684            952           83         3
15 18    Indiana              27247            782          117         3
16 19    Iowa                 30002            740          143         4
17 20    Kansas               29126            801          208         5
18 21    Kentucky             24702            713          159         4
19 22    Louisiana            25086            825          155         4
20 23    Maine                26841            808          187         7
21 24    Maryland             37147           1311          152         5
22 25    Massachusetts        34498           1173          199         5
23 26    Michigan             26987            824           82         3
24 27    Minnesota            32734            906          189         4
25 28    Mississippi          22766            740          194         5
26 29    Missouri             26999            784          113         4
27 30    Montana              26249            751          206         9
28 31    Nebraska             30020            773          146         4
29 32    Nevada               29019           1017          213         6
30 33    New Hampshire        33172           1052          387         9
31 34    New Jersey           35075           1249          148         4
32 35    New Mexico           24457            809          214         6
33 36    New York             31057           1194           69         3
34 37    North Carolina       26482            844          111         3
35 38    North Dakota         32336            775          245         9
36 39    Ohio                 27435            764           94         2
37 40    Oklahoma             26207            766          101         3
38 41    Oregon               27389            988          146         4
39 42    Pennsylvania         28923            885          119         3
40 44    Rhode Island         30210            957          259         6
41 45    South Carolina       25454            836          123         4
42 46    South Dakota         28821            696          276         7
43 47    Tennessee            25453            808          102         4
44 48    Texas                28063            952          110         2
45 49    Utah                 27928            948          239         6
46 50    Vermont              29351            945          361        11
47 51    Virginia             32545           1166          202         5
48 53    Washington           32318           1120          113         4
49 54    West Virginia        23707            681          203         6
50 55    Wisconsin            29868            813          135         3
51 56    Wyoming              30854            828          342        11
52 72    Puerto Rico             NA            464           NA         6

You can also perform aggregation with `values_fn`:

In [0]:
warpbreaks <- as_tibble(warpbreaks[c("wool", "tension", "breaks")])
head(warpbreaks)

  wool tension breaks
1 A    L       26
2 A    L       30
3 A    L       54
4 A    L       25
5 A    L       70
6 A    L       52

In [0]:
warpbreaks %>%
  pivot_wider(
    names_from = wool,
    values_from = breaks,
    values_fn = list(breaks = mean)
  )

  tension A        B
1 L       44.55556 28.22222
2 M       24.00000 28.77778
3 H       24.55556 18.77778

## **pivot_longer()**

`pivot_longer()` does the reverse of `pivot_wider()`. `pivot_longer()` collects a set of column names and places them into a single “key” column. It also collects the cells of those columns and places them into a single value column.

In [0]:
devtools::install_github("garrettgman/DSR")
library(DSR)

Skipping install of 'DSR' from a github remote, the SHA1 (07c9a350) has not changed since last install.
  Use `force = TRUE` to force installation


Attaching package: ‘DSR’


The following objects are masked from ‘package:tidyr’:

    table1, table2, table3, table5, who

In [0]:
table4

  country     1999   2000
1 Afghanistan    745   2666
2 Brazil       37737  80488
3 China       212258 213766

In [0]:
table4 %>%
pivot_longer(c("1999", "2000"), names_to = "year", values_to = "cases")

  country     year cases
1 Afghanistan 1999    745
2 Afghanistan 2000   2666
3 Brazil      1999  37737
4 Brazil      2000  80488
5 China       1999 212258
6 China       2000 213766

If you have multiple columns need to be reshaped:

In [0]:
head(relig_income)

  religion           <$10k $10-20k $20-30k $30-40k $40-50k $50-75k $75-100k
1 Agnostic            27    34       60     81      76      137    122
2 Atheist             12    27       37     52      35       70     73
3 Buddhist            27    21       30     34      33       58     62
4 Catholic           418   617      732    670     638     1116    949
5 Don’t know/refused  15    14       15     11      10       35     21
6 Evangelical Prot   575   869     1064    982     881     1486    949
  $100-150k >150k Don't know/refused
1 109        84     96
2  59        74     76
3  39        53     54
4 792       633   1489
5  17        18    116
6 723       414   1529

In [0]:
relig_income %>% 
  pivot_longer(-religion, names_to = "income", values_to = "count")

    religion              income             count
1   Agnostic              <$10k               27
2   Agnostic              $10-20k             34
3   Agnostic              $20-30k             60
4   Agnostic              $30-40k             81
5   Agnostic              $40-50k             76
6   Agnostic              $50-75k            137
7   Agnostic              $75-100k           122
8   Agnostic              $100-150k          109
9   Agnostic              >150k               84
10  Agnostic              Don't know/refused  96
11  Atheist               <$10k               12
12  Atheist               $10-20k             27
13  Atheist               $20-30k             37
14  Atheist               $30-40k             52
15  Atheist               $40-50k             35
16  Atheist               $50-75k             70
17  Atheist               $75-100k            73
18  Atheist               $100-150k           59
19  Atheist               >150k               74
20  Atheist               Don't know/refused  76
21  Buddhist              <$10k               27
22  Buddhist              $10-20k             21
23  Buddhist              $20-30k             30
24  Buddhist              $30-40k             34
25  Buddhist              $40-50k             33
26  Buddhist              $50-75k             58
27  Buddhist              $75-100k            62
28  Buddhist              $100-150k           39
29  Buddhist              >150k               53
30  Buddhist              Don't know/refused  54
⋮   ⋮                     ⋮                  ⋮
151 Other Faiths          <$10k               20
152 Other Faiths          $10-20k             33
153 Other Faiths          $20-30k             40
154 Other Faiths          $30-40k             46
155 Other Faiths          $40-50k             49
156 Other Faiths          $50-75k             63
157 Other Faiths          $75-100k            46
158 Other Faiths          $100-150k           40
159 Other Faiths          >150k               41
160 Other Faiths          Don't know/refused  71
161 Other World Religions <$10k                5
162 Other World Religions $10-20k              2
163 Other World Religions $20-30k              3
164 Other World Religions $30-40k              4
165 Other World Religions $40-50k              2
166 Other World Religions $50-75k              7
167 Other World Religions $75-100k             3
168 Other World Religions $100-150k            4
169 Other World Religions >150k                4
170 Other World Religions Don't know/refused   8
171 Unaffiliated          <$10k              217
172 Unaffiliated          $10-20k            299
173 Unaffiliated          $20-30k            374
174 Unaffiliated          $30-40k            365
175 Unaffiliated          $40-50k            341
176 Unaffiliated          $50-75k            528
177 Unaffiliated          $75-100k           407
178 Unaffiliated          $100-150k          321
179 Unaffiliated          >150k              258
180 Unaffiliated          Don't know/refused 597

you may also use 

```
cols = c(), cols = start_with(), cols = "<$10k":"Don't know/refused", ...
```

You may also encounter problems involve multiple observations per row:

In [0]:
family <- tribble(
  ~family,  ~dob_child1,  ~dob_child2, ~gender_child1, ~gender_child2,
       1L, "1998-11-26", "2000-01-29",             1L,             2L,
       2L, "1996-06-22",           NA,             2L,             NA,
       3L, "2002-07-11", "2004-04-05",             2L,             2L,
       4L, "2004-10-10", "2009-08-27",             1L,             1L,
       5L, "2000-12-05", "2005-02-28",             2L,             1L,
)
family <- family %>% mutate_at(vars(starts_with("dob")), parse_date)
family

  family dob_child1 dob_child2 gender_child1 gender_child2
1 1      1998-11-26 2000-01-29 1              2
2 2      1996-06-22 <NA>       2             NA
3 3      2002-07-11 2004-04-05 2              2
4 4      2004-10-10 2009-08-27 1              1
5 5      2000-12-05 2005-02-28 2              1

In [0]:
family %>% 
  pivot_longer(
    -family, 
    names_to = c(".value", "child"), 
    names_sep = "_", 
    values_drop_na = TRUE
  )

  family child  dob        gender
1 1      child1 1998-11-26 1
2 1      child2 2000-01-29 2
3 2      child1 1996-06-22 2
4 3      child1 2002-07-11 2
5 3      child2 2004-04-05 2
6 4      child1 2004-10-10 1
7 4      child2 2009-08-27 1
8 5      child1 2000-12-05 2
9 5      child2 2005-02-28 1

## **separate() and unite()**

`pivot_longer()` and `pivot_wider()` help you reshape the layout of your data to place variables in columns and observations in rows. `separate()` and `unite()` help you split and combine cells to place a single, complete value in each cell.

### **separate()**

`separate()` turns a single character column into multiple columns by splitting the values of the column wherever a separator character appears.

In [0]:
df <- data.frame(x = c(NA, "a.b", "a.d", "b.c"))
df

  x
1 NA
2 a.b
3 a.d
4 b.c

In [0]:
df %>% separate(x, c("A", "B"))

  A  B
1 NA NA
2 a  b
3 a  d
4 b  c

In [0]:
# If you just want the second variable:
df %>% separate(x, c(NA, "B"))

  B
1 NA
2 b
3 d
4 c

### **unite()**
`unite()` does the opposite of separate(): it combines multiple columns into a single column.

In [0]:
table6

  country     century year rate
1 Afghanistan 19      99   745/19987071
2 Afghanistan 20      00   2666/20595360
3 Brazil      19      99   37737/172006362
4 Brazil      20      00   80488/174504898
5 China       19      99   212258/1272915272
6 China       20      00   213766/1280428583

In [0]:
unite(table6, "new", century, year, sep = "")

  country     new  rate
1 Afghanistan 1999 745/19987071
2 Afghanistan 2000 2666/20595360
3 Brazil      1999 37737/172006362
4 Brazil      2000 80488/174504898
5 China       1999 212258/1272915272
6 China       2000 213766/1280428583

### **Exercise**:

1.   The `fish_encounters` dataset only records when a fish was detected by the station - it doesn’t record when it wasn’t detected. Suppose we know that the absence of a record means that the fish was not seen, use `pivot_wider()` and `values_fill` argument to fill these missing values in with zeros(and also try to use chaining operator).



2.   Tidy the following dataset:
 *   make it longer and eliminate the explcit `NA`s, add a column with name `checked` and assign value `TRUE` to each entry of the `checked` column.
 *   make the data wider, filling in the missing observations with `FALSE`(use `values_fill`)

In [0]:
multi <- tribble(
  ~id, ~choice1, ~choice2, ~choice3,
  1, "A", "B", "C",
  2, "C", "B",  NA,
  3, "D",  NA,  NA,
  4, "B", "D",  NA
)

3.   Tidy the following dataset:
 *   Notice year is spread across multiple columns, first make it longer.
 *   Split the indicator up into two variables: `area` (total or urban) and `variable` (population or growth), i.e. discard "SP", keep other two characters and assign them to `area` and `variable` respectively.
 *   Complete the tidying by pivoting variable and value

In [0]:
world_bank_pop
head(world_bank_pop)

  country indicator   2000         2001         2002         2003
1 ABW     SP.URB.TOTL 4.244400e+04 4.304800e+04 4.367000e+04 4.424600e+04
2 ABW     SP.URB.GROW 1.182632e+00 1.413021e+00 1.434560e+00 1.310360e+00
3 ABW     SP.POP.TOTL 9.085300e+04 9.289800e+04 9.499200e+04 9.701700e+04
4 ABW     SP.POP.GROW 2.055027e+00 2.225930e+00 2.229056e+00 2.109354e+00
5 AFG     SP.URB.TOTL 4.436299e+06 4.648055e+06 4.892951e+06 5.155686e+06
6 AFG     SP.URB.GROW 3.912228e+00 4.662838e+00 5.134675e+00 5.230459e+00
  2004         2005         2006          2007          2008
1 4.466900e+04 4.488900e+04  4.488100e+04  4.468600e+04  4.437500e+04
2 9.514777e-01 4.913027e-01 -1.782333e-02 -4.354289e-01 -6.984006e-01
3 9.873700e+04 1.000310e+05  1.008320e+05  1.012200e+05  1.013530e+05
4 1.757353e+00 1.302039e+00  7.975628e-01  3.840600e-01  1.313107e-01
5 5.426770e+06 5.691823e+06  5.931413e+06  6.151939e+06  6.364968e+06
6 5.124393e+00 4.768647e+00  4.123188e+00  3.650485e+00  3.404189e+00
  2009          2010          2011         2012         2013
1  4.405200e+04  4.377800e+04 4.382200e+04 4.406400e+04 4.436000e+04
2 -7.305493e-01 -6.239346e-01 1.004566e-01 5.507148e-01 6.695040e-01
3  1.014530e+05  1.016690e+05 1.020530e+05 1.025770e+05 1.031870e+05
4  9.861642e-02  2.126801e-01 3.769848e-01 5.121450e-01 5.929140e-01
5  6.588859e+06  6.837008e+06 7.114615e+06 7.416385e+06 7.733964e+06
6  3.457099e+00  3.697002e+00 3.980091e+00 4.154062e+00 4.192980e+00
  2014         2015         2016         2017
1 4.467400e+04 4.497900e+04 4.527500e+04 4.557200e+04
2 7.053514e-01 6.804037e-01 6.559290e-01 6.538489e-01
3 1.037950e+05 1.043410e+05 1.048220e+05 1.052640e+05
4 5.874924e-01 5.246582e-01 4.599292e-01 4.207807e-01
5 8.054214e+06 8.367663e+06 8.670939e+06 8.971345e+06
6 4.057389e+00 3.817920e+00 3.560246e+00 3.405852e+00